Repository: baonlq/html5rocks
Catalog: www.html5rocks.com/conf/locale/*/LC_MESSAGES/django.po
Languages: es

source: Invalid chracter in attribute name
es: Carácter no válido en el nombre del atributo

source: Dropped duplicate attribute on tag.
es: Se ha soltado un atributo duplicado en la etiqueta.

source: Unexpected end of file. Expected = or end of tag.
es: Fin de archivo inesperado. Se esperaba = o el final de la etiqueta.

source: Unexpected end of file. Expected attribute value.
es: Fin de archivo inesperado. Valor del atributo esperado.

source: Expected attribute value. Got '>' instead.
es: Valor esperado del atributo. Se obtuvo ">" en su lugar.

source: Unexpected end of file in attribute value (").
es: Fin de archivo inesperado en el valor del atributo (")

source: Unexpected end of file in attribute value (').
es: Fin de archivo inesperado en el valor del atributo (')

source: Unexpected end of file in attribute value.
es: Fin de archivo inesperado en el valor del atributo

source: Unexpected end of file in tag. Expected >
es: Fin de archivo inesperado en la etiqueta. Se esperaba ">".

source: Unexpected character after / in tag. Expected >
es: Carácter inesperado después de la / en la etiqueta. Se esperaba >.

source: Expected '--' or 'DOCTYPE'. Not found.
es: Se esperaba "-" o "DOCTYPE". No se encontró.

source: Incorrect comment.
es: Comentario incorrecto

source: Unexpected end of file in comment.
es: Fin de archivo inesperado en el comentario

source: Unexpected end of file in comment (-)
es: Fin de archivo inesperado en el comentario (-)

source: Unexpected '-' after '--' found in comment.
es: Se encontró un "-" inesperado después de "--" en el comentario.

source: Unexpected end of file in comment (--).
es: Fin de archivo inesperado en el comentario (--)

source: Unexpected character in comment found.
es: Se encontró un carácter inesperado en el comentario.

source: No space after literal string 'DOCTYPE'.
es: Sin espacio después de la cadena literal "DOCTYPE"

source: Unexpected > character. Expected DOCTYPE name.
es: Caracter > inesperado. Se esperaba el nombre DOCTYPE.

source: Unexpected end of file. Expected DOCTYPE name.
es: Fin de archivo inesperado. Se esperaba el nombre del DOCTYPE.

source: Unexpected end of file in DOCTYPE name.
es: Fin de archivo inesperado en el nombre de DOCTYPE

source: Unexpected end of file in DOCTYPE.
es: Fin de archivo inesperado en DOCTYPE

source: Expected space or '>'. Got '%(data)s'
es: Se esperaba un espacio o ">". Se obtuvo "%(data)s".

source: Unexpected end of DOCTYPE.
es: Final inesperado de DOCTYPE

source: Unexpected character in DOCTYPE.
es: Carácter inesperado en DOCTYPE

source: XXX innerHTML EOF
es: FDA XXX innerHTML

source: Unexpected DOCTYPE. Ignored.
es: DOCTYPE inesperado (ignorado)

source: html needs to be the first start tag.
es: html tiene que ser la primera etiqueta de inicio.

source: Unexpected End of file. Expected DOCTYPE.
es: Fin de archivo inesperado. DOCTYPE esperado.

source: Erroneous DOCTYPE.
es: DOCTYPE erróneo

source: Unexpected non-space characters. Expected DOCTYPE.
es: Caracteres sin espacios inesperados. Se esperaba DOCTYPE.

source: Unexpected start tag (%(name)s). Expected DOCTYPE.
es: Etiqueta de inicio inesperada (%(name)s). DOCTYPE esperado.

source: Unexpected end tag (%(name)s). Expected DOCTYPE.
es: Etiqueta de cierre inesperada (%(name)s). DOCTYPE esperado.

source: Unexpected end tag (%(name)s) after the (implied) root element.
es: Etiqueta de cierre inesperada (%(name)s) después del elemento raíz (implícito)

source: Unexpected end of file. Expected end tag (%(name)s).
es: Fin de archivo inesperado. Etiqueta de cierre esperada (%(name)s).

source: Unexpected start tag head in existing head. Ignored.
es: Encabezado de etiqueta de inicio inesperado en el encabezado existente (ignorado)

source: Unexpected end tag (%(name)s). Ignored.
es: Etiqueta de cierre inesperada (%(name)s) (ignorada)

source: Unexpected start tag (%(name)s) that can be in head. Moved.
es: Se ha movido la etiqueta de inicio inesperada (%(name)s) que puede estar en el encabezado.

source: Unexpected start tag (%(name)s).
es: Etiqueta de inicio inesperada (%(name)s)

source: Missing end tag (%(name)s).
es: Falta la etiqueta de cierre (%(name)s).

source: Missing end tags (%(name)s).
es: Faltan etiquetas de cierre (%(name)s).

source: Unexpected start tag (%(startName)s) implies end tag (%(endName)s).
es: La etiqueta de inicio inesperada (%(startName)s) implica una etiqueta de cierre (%(endName)s).

source: Unexpected start tag (%(originalName)s). Treated as %(newName)s.
es: Etiqueta de inicio inesperada (%(originalName)s). Tratada como %(newName)s.

source: Unexpected start tag %(name)s. Don't use it!
es: Etiqueta de inicio inesperada %(name)s. ¡No debes utilizarla!

source: Unexpected start tag %(name)s. Ignored.
es: Etiqueta de inicio inesperada %(name)s. Ignorada.

source: Unexpected end tag (%(gotName)s). Missing end tag (%(expectedName)s).
es: Etiqueta de cierre inesperada (%(gotName)s). Falta la etiqueta final (%(expectedName)s).

source: End tag (%(name)s) seen too early. Expected other end tag.
es: Etiqueta de cierre (%(name)s) vista demasiado pronto. Se esperaba otra etiqueta de cierre.

source: Unexpected end tag (%(gotName)s). Expected end tag (%(expectedName)s).
es: Etiqueta de cierre inesperada (%(gotName)s). Etiqueta de cierre esperada (%(expectedName)s).

source: End tag (%(name)s) seen too early. Ignored.
es: La etiqueta de cierre (%(name)s) ha aparecido demasiado pronto (ignorada).

source: End tag (%(name)s) violates step 1, paragraph 1 of the adoption agency algorithm.
es: La etiqueta de cierre (%(name)s) infringe el paso 1, párrafo 1 del algoritmo de la agencia de adopción.

source: End tag (%(name)s) violates step 1, paragraph 2 of the adoption agency algorithm.
es: La etiqueta de cierre (%(name)s) infringe el paso 1, párrafo 2 del algoritmo de la agencia de adopción.

source: End tag (%(name)s) violates step 1, paragraph 3 of the adoption agency algorithm.
es: La etiqueta de cierre (%(name)s) infringe el paso 1, el párrafo 3 del algoritmo de la agencia de adopción.

source: Unexpected end tag (%(originalName)s). Treated as %(newName)s.
es: Etiqueta de cierre inesperada (%(originalName)s). Tratado como %(newName)s.

source: This element (%(name)s) has no end tag.
es: Este elemento (%(name)s) no tiene etiqueta de cierre.

source: Unexpected implied end tag (%(name)s) in the table phase.
es: Etiqueta implícita de cierre inesperada (%(name)s) en la fase de la tabla

source: Unexpected implied end tag (%(name)s) in the table body phase.
es: Etiqueta implícita de cierre inesperada (%(name)s) en la fase del cuerpo de la tabla

source: Unexpected non-space characters in table context caused voodoo mode.
es: Los caracteres sin espacios inesperados en el contexto de la tabla han causado el modo de vudú.

source: Unexpected input with type hidden in table context.
es: Entrada inesperada con tipo oculto en el contexto de la tabla

source: Unexpected form in table context.
es: Formato inesperado en el contexto de la tabla

source: Unexpected start tag (%(name)s) in table context caused voodoo mode.
es: La etiqueta de inicio inesperada (%(name)s) en el contexto de la tabla ha causado el modo vudú.

source: Unexpected end tag (%(name)s) in table context caused voodoo mode.
es: La etiqueta de cierre inesperada (%(name)s) en el contexto de la tabla ha causado el modo vudú.

source: Unexpected table cell start tag (%(name)s) in the table body phase.
es: Etiqueta de inicio de celda de tabla inesperada (%(name)s) en la fase de cuerpo de la tabla.

source: Got table cell end tag (%(name)s) while required end tags are missing.
es: Se obtuvo una etiqueta de fin de celda de tabla inesperada (%(name)s), aunque faltan las etiquetas de cierre obligatorias.

source: Unexpected end tag (%(name)s) in the table body phase. Ignored.
es: Etiqueta de cierre inesperada (%(name)s) en la fase del cuerpo de la tabla (ignorada)

source: Unexpected implied end tag (%(name)s) in the table row phase.
es: Etiqueta implícita de cierre inesperada (%(name)s) en la fase de filas de la tabla

source: Unexpected end tag (%(name)s) in the table row phase. Ignored.
es: Etiqueta de cierre inesperada (%(name)s) en la fase de filas de la tabla (ignorada)

source: Unexpected select start tag in the select phase treated as select end tag.
es: La etiqueta de inicio de selección inesperada en la fase de selección se ha tratado como la etiqueta de cierre de selección.

source: Unexpected input start tag in the select phase.
es: Etiqueta de inicio de entrada inesperada en la fase de selección

source: Unexpected start tag token (%(name)s in the select phase. Ignored.
es: Token de etiqueta de inicio inesperado (%(name)s) en la fase de selección (ignorado)

source: Unexpected end tag (%(name)s) in the select phase. Ignored.
es: Etiqueta de cierre inesperada (%(name)s) en la fase de selección (ignorada)

source: Unexpected table element start tag (%(name)s) in the select in table phase.
es: Etiqueta de inicio de elemento de la tabla inesperada (%(name)s) en la fase de selección de la tabla

source: Unexpected table element end tag (%(name)s) in the select in table phase.
es: Etiqueta de cierre de elemento tabla inesperada (%(name)s) en la fase de selección en tabla

source: Unexpected non-space characters in the after body phase.
es: Caracteres sin espacio inesperados en la fase posterior al cuerpo

source: Unexpected start tag token (%(name)s) in the after body phase.
es: Token de etiqueta de inicio inesperado (%(name)s) en la fase posterior del cuerpo

source: Unexpected end tag token (%(name)s) in the after body phase.
es: Token de etiqueta de cierre inesperada (%(name)s) en la fase posterior al cuerpo

source: Unepxected characters in the frameset phase. Characters ignored.
es: Caracteres inesperados en la fase de conjunto de marcos. Caracteres ignorados.

source: Unexpected start tag token (%(name)s) in the frameset phase. Ignored.
es: Token de etiqueta de inicio inesperado (%(name)s) en la fase del conjunto de marcos (ignorado)

source: Unexpected end tag token (frameset) in the frameset phase (innerHTML).
es: Token de etiqueta de cierre inesperada (marcos) en la fase del conjunto de marcos (innerHTML)

source: Unexpected end tag token (%(name)s) in the frameset phase. Ignored.
es: Token de etiqueta de cierre inesperado (%(name)s) en la fase del conjunto de marcos (ignorado)

source: Unexpected non-space characters in the after frameset phase. Ignored.
es: Caracteres sin espacios inesperados en la fase posterior al conjunto de marcos (ignorados)

source: Unexpected start tag (%(name)s) in the after frameset phase. Ignored.
es: Etiqueta de inicio inesperada (%(name)s) en la fase posterior del conjunto de marcos (ignorada)

source: Unexpected end tag (%(name)s) in the after frameset phase. Ignored.
es: Etiqueta de cierre inesperada (%(name)s) en la fase posterior del conjunto de marcos. Ignorada.

source: Unexpected end tag after body(innerHtml)
es: Etiqueta de cierre inesperada después del cuerpo (innerHTML)

source: Unexpected non-space characters. Expected end of file.
es: Caracteres sin espacios inesperados. Se esperaba el final de archivo.

source: Unexpected start tag (%(name)s). Expected end of file.
es: Etiqueta de inicio inesperada (%(name)s). Fin de archivo esperado.

source: Unexpected end tag (%(name)s). Expected end of file.
es: Etiqueta de cierre inesperada (%(name)s). Final de archivo esperado.

source: Unexpected end of file. Expected table content.
es: Fin de archivo inesperado. Contenido de la tabla esperado.

source: Unexpected end of file. Expected select content.
es: Fin de archivo inesperado. Contenido de selección esperado.

source: Unexpected end of file. Expected frameset content.
es: Fin de archivo inesperado. Contenido del conjunto de datos esperado.

source: Unexpected end of file. Expected script content.
es: Fin de archivo inesperado. Contenido del comando de secuencias esperado.

source: Trailing solidus not allowed on element %(name)s
es: No se permite la barra oblicua en el elemento %(name)s.

source: Element %(name)s not allowed in a non-html context
es: Elemento %(name)s no permitido en un contexto que no sea html

source: Unexpected end tag (%(name)s) before html.
es: Etiqueta de cierre inesperada (%(name)s) antes de HTML

source: StartTag not in PCDATA content model flag: %(tag)s
es: La etiqueta de inicio no tiene la marca de modelo de contenido PCDATA: %(tag)s

source: Tag name is not a string: %(tag)r
es: El nombre de la etiqueta no es una cadena: %(tag)r

source: Empty tag name
es: Nombre de la etiqueta vacío

source: Void element reported as StartTag token: %(tag)s
es: Elemento vacío informado como token de etiqueta de inicio: %(tag)s

source: Non-void element reported as EmptyTag token: %(tag)s
es: Elemento no vacío informado como token de etiqueta vacía: %(tag)s

source: Attribute name is not a string: %(name)r
es: El nombre del atributo no es una cadena: %(name)r

source: Empty attribute name
es: Nombre del atributo vacío

source: Attribute value is not a string: %(value)r
es: El valor del atributo no es una cadena: %(value)r

source: Void element reported as EndTag token: %(tag)s
es: Elemento vacío informado como token de etiqueta de cierre: %(tag)s

source: EndTag (%(end)s) does not match StartTag (%(start)s)
es: La etiqueta de cierre (%(end)s) no coincide con la de inicio (%(start)s)

source: Comment not in PCDATA content model flag
es: El comentario no tiene marca de modelo de contenido PCDATA

source: %(type)s token with empty data
es: Token %(type)s con datos vacíos

source: Non-space character(s) found in SpaceCharacters token: %(token)r
es: Se han encontrado caracteres sin espacios en el token de caracteres de espacio: %(token)r.

source: Doctype not in PCDATA content model flag: %(name)s
es: El tipo de contenido no tiene la marca de contenido modelo PCDATA: %(name)s

source: Unknown token type: %(type)s
es: Tipo de token desconocido: %(type)s

source: System identifer contains both single and double quote characters
es: El identificador de sistema contiene caracteres de comillas simples y dobles

source: Unexpected </ in CDATA
es: </ inesperado en CDATA

source: Unexpected child element of a CDATA element
es: Elemento secundario inesperado de un elemento CDATA

source: Comment contains --
es: El comentario contiene -

source: Void element has children
es: El elemento nulo contiene elementos secundarios.

source: Unknown node type:
es: Tipo de nodo desconocido:

source: Text nodes are text or tail, found %s
es: Los nodos de texto son texto o cola, se encontraron %s

source: Text nodes have no children
es: Los nodos de texto no tienen textos dependientes.

source: 404 - Page Not Found
es: 404 - Página no encontrada

source: I pity da foo who doesn't use HTML5!
es: ¡Pobre el que no usa HTML5!

source: Oops!! We didn't find any HTML<sub>5</sub> resources here.
es: ¡Vaya! No se encontró ningún recurso HTML <sub>5</sub> aquí.

source: Except as otherwise <a href="http://code.google.com/policies.html#restrictions">noted</a>, the content of this page is licensed under the <a href="http://creativecommons.org/licenses/by/3.0/">Creative Commons Attribution 3.0 License</a>, and code samples are licensed under the <a href="http://www.apache.org/licenses/LICENSE-2.0">Apache 2.0 License</a>.
es: Salvo que se <a href="http://code.google.com/policies.html#restrictions">notifique</a> lo contrario, el contenido de esta página está sujeto a la <a href="http://creativecommons.org/licenses/by/3.0/">Licencia Creative Commons Attribution 3.0</a>, <br> y las muestras de códigos están sujetas a la <a href="http://www.apache.org/licenses/LICENSE-2.0">Licencia Apache 2.0</a>.

source: Please enable JavaScript to view the comments powered by Disqus.
es: Habilita JavaScript para visualizar los comentarios con la tecnología de Disqus.

source: A resource for developers looking to put HTML5 to use today, including information on specific features and when to use them in your apps.
es: Un recurso para los programadores que quieran utilizar HTML5 hoy mismo, que incluye información sobre funciones específicas y sobre cuándo utilizarlas en tus aplicaciones

source: html5,html 5,html5 demos,html5 examples,javascript,css3,notifications,geolocation,web workers,apppcache,file api,filereader,indexeddb,offline,audio,video,drag and drop,chrome,sse,mobile
es: html5,html 5,demostraciones de html5,ejemplos de html5,javascript,css3,notificaciones,geolocalización,trabajadores web,caché de la aplicación,api de archivos,lector de archivos,db indexado,sin conexión,audio,video,arrastrar y soltar,chrome,sse,móvil

source: Updates &amp; Tutorials
es: Actualizaciones &amp; tutoriales

source: Slides
es: Diapositivas

source: Who We Are
es: Quiénes somos

source: Search
es: Búsqueda

source: Intro
es: Introducción

source: Demos
es: Demostraciones

source: In the Wild
es: En la naturaleza

source: Themes
es: Temas

source: Technologies
es: Tecnologías

source: Techniques
es: Técnicas

source: Further Reading
es: Material de lectura adicional

source: HTML5 Logo
es: Logo de HTML5

source: Terms
es: Condiciones

source: Privacy
es: Privacidad

source: Report bug or request a feature
es: Informa un error o solicita una función

source: Follow us on Twitter
es: Síguenos en Twitter.

source: About Authors
es: Acerca de los autores

source: Made by Google
es: Hecho por Google

source: This site contains information on APIs that are not part of the W3C HTML5 specification.
es: Este sitio contiene información sobre las API que no son parte de la especificación W3C HTML5.

source: A new version of this site is available. Load it?
es: Hay una nueva versión de este sitio disponible. ¿Deseas cargarla?

source: HTML5 Powered
es: Con la tecnología de HTML5

source: Supported browsers:
es: Navegadores admitidos

source: supported
es: compatibles

source: unsupported
es: no compatible

source: Your browser may not support all of the functionality in this article.
es: Es posible que tu navegador no admita todas las funciones que se mencionan en este artículo.

source: Your browser appears to support all of the functionality in this article.
es: Tu navegador parece admitir todas las funcionalidades que se mencionan en este artículo.

source: Leave a comment
es: Dejar un comentario

source: Table of Contents
es: Índice
