Repository: baonlq/html5rocks
Catalog: www.html5rocks.com/conf/locale/*/LC_MESSAGES/django.po
Languages: es

source: Developers are taking advantage of these features: a flood of HTML graphics demos have been showing up on the web, ranging from implementations of old 2D graphics algorithms, to brand new techniques created specifically for the modern web.
es: Los programadores están aprovechando estas funciones: una avalancha de demostraciones de gráficos HTML han estado apareciendo en la Web, y van desde las implementaciones de antiguos algoritmos gráficos 2D a las técnicas nuevas creadas específicamente para la Web actual.

source: Browser Support
es: Ayuda del navegador

source: &ldquo;Graphics&rdquo; is such a wide topic that there are several specifications being worked on. A comprehensive graphics demo may use several of the following:
es: Los &ldquo;gráficos&rdquo; son un tema tan amplio que se están realizando varias especificaciones. Una demostración de gráficos exhaustiva puede utilizar varios de los siguientes elementos:

source: PNG Alpha Transparency
es: Transparencia Alfa PNG

source: Data URLs
es: Datos URL

source: CSS3 Colors
es: Colores CSS3

source: SVG (basic support)
es: SVG (soporte básico)

source: Canvas (basic support)
es: Lienzo (compatibilidad básica)

source: Video element
es: Elemento en video

source: CSS Transforms
es: Transformaciones CSS

source: Text API for Canvas
es: API de texto para el lienzo

source: SVG in CSS Backgrounds
es: SVG en fondos de CSS

source: SVG effects for HTML elements
es: Efectos SVG para los elementos HTML

source: SVG SMIL animation
es: Animación SVG SMIL

source: SVG Fonts
es: Fuentes SVG

source: SVG filters
es: Filtros SVG

source: CSS3 Animation
es: Animación CSS3

source: Inline SVG in HTML5
es: SVG en línea en HTML5

source: 3D Canvas graphics / WebGL
es: Gráficos en lienzo 3D/WebGL

source: CSS 3D Transforms
es: Transformaciones CSS 3D

source: Click each specification to see its support status on <a href="http://caniuse.com/">caniuse.com</a>. Chrome-specific details can be found on the <a href="http://dev.chromium.org/developers/web-platform-status">Chrome Platform Status</a>.
es: Haz clic en cada especificación para ver su estado de compatibilidad en <a href="http://caniuse.com/">caniuse.com</a>. Encuentra detalles específicos de Chrome en la <a href="http://dev.chromium.org/developers/web-platform-status">Plataforma de estado de Chrome</a>.

source: Various WebGL / canvas demos which take advantage of HW accel
es: Varias demostraciones del elemento canvas o WebGL que se benefician de la aceleración por hardware

source: WebGL solid modeling CAD
es: CAD de modelado sólido WebGL

source: 3D effects without WebGL
es: Efectos 3D sin WebGL

source: Nicely polished canvas experiments
es: Experimentos brillantes sobre el lienzo

source: Old-school games effect
es: Efecto de juegos de la vieja escuela

source: Various canvas demos which take advantage of HW accel
es: Varias demostraciones de lienzo que aprovechan la aceleración por hardware

source: Nice integration between video and canvas
es: Buena integración entre el video y el lienzo

source: Support SVG on all browsers
es: SVG admitido en todos los navegadores

source: SVG, CSS, Canvas support for Illustrator
es: Compatibilidad con SVG, CSS y Lienzo para Illustrator

source: Animation library wrapping SVG
es: Biblioteca de animación que envuelve SVG

source: JavaScript scenegraph library for the canvas element
es: Biblioteca JavaScript de gráficos de escenas para el elemento lienzo

source: Port of Processing animation scripting language to JavaScript - uses canvas
es: Puerto del lenguaje de secuencias de comandos de animación de procesamiento en JavaScript (utiliza lienzo)

source: Lightweight 3D engine, uses canvas, SVG, WebGL
es: Motor 3D liviano, utiliza lienzo, ​​SVG, WebGL

source: Background and details on the implementation of hardware accelerated compositing in Chrome
es: Antecedentes y detalles sobre la implementación de la composición acelerada por hardware en Chrome

source: Features
es: Funciones

source: Audio and Video became first-class citizens on the Web with HTML5 the same way that other media types like images did in the past. Through their new APIs you can access, control and manipulate timeline data and network states of the files. With the coming additions to the APIs you will be able to read and write raw data to audio files (Audio Data API) or manipulate captions in videos (Timed Track API). But the real power of these new HTML elements stands out when they are combined with the other technologies of the web stack, be it Canvas, SVG, CSS or even WebGL.
es: El audio y el video se han convertido en elementos destacados de la Web gracias a HTML5, como lo hicieron anteriormente otros tipos de medios, por ejemplo, las imágenes. A través de sus nuevas API, puedes acceder, controlar y manipular los datos de línea de tiempo y los estados de la red de los archivos. Con las próximas adiciones a las API, podrás leer y escribir datos en bruto en los archivos de audio (API de datos de audio) o manipular subtítulos en los videos (API de seguimiento del tiempo). Pero el verdadero poder de estos nuevos elementos HTML se destaca cuando se combinan con las otras tecnologías de red de la pila, ya sea lienzo, SVG, CSS o incluso WebGL.

source: For instance, you can build a DJ mixer table app where you show several controls to fade and mix audio tracks. Canvas lets you read pixel data from videos so you could add a video visualizer with a scene selection feature and, on top of that, use SVG filters &aacute; la Photoshop to distort the movie while the videos are playing.
es: Por ejemplo, puedes crear una aplicación de mezcla para DJ en la que muestres varios controles para atenuar o mezclar canciones. La función Canvas te permite leer datos de píxeles de videos para que puedan agregar un visualizador de videos con una función de selección de escenas y, lo que es más importante, utilizar filtros SVG &aacute; Photoshop para distorsionar la película mientras se reproducen los videos.

source: This W3C specification defines the audio element with all the available methods, attributes and events.
es: Esta especificación W3C define el elemento de audio con todos los métodos, atributos y eventos disponibles.

source: This W3C specification defines the video element with all the available methods, attributes and events.
es: Esta especificación W3C define el elemento de video con todos los métodos, atributos y eventos disponibles.

source: This W3C specification defines those methods and properties which are common to both audio and video elements.
es: Esta especificación W3C define los métodos y las propiedades que son comunes para los elementos de audio y video.

source: A subset of the media element spec currently being written where it defines means to handle metadata of audio/video files such as captions and subtitles.
es: Un subconjunto de las especificaciones de los elementos de medios que se está escribiendo en la actualidad, y en el que se definen los medios para administrar metadatos de archivos de audio/video, tales como títulos y subtítulos.

source: Draft recommendation for Audio Data API where methods are defined to read and write spectrum data of audio files.
es: Recomendación en borrador para la API de datos de audio, donde se definen los métodos para leer y escribir datos del espectro de archivos de audio

source: Nuts & Bolts
es: Aspectos básicos

source: HTML5 is now an umbrella term that many people use to describe the amazing improvements coming to the web platform. It's a platform that is becoming more powerful by the day. Most people have heard of the rich APIs (css3, audio/video, WebGL, offline, geolocation,...), but there's also a slew of lesser-known features that you should be aware of. We call these the "nuts &amp; bolts" of building modern web applications.
es: HTML5 ahora es un término global que muchas personas utilizan para describir las increíbles mejoras a la plataforma web. Se trata de una plataforma que se potencia día a día. La mayoría han escuchado acerca de las API enriquecidas (css3, audio/video, WebGL, sin conexión, geolocalización,...), pero también hay una gran cantidad de características menos conocidas de las que debes estar al tanto y a las que denominamos "aspectos básicos" para crear aplicaciones web modernas.

source: Isn't it painful to build web apps? Luckily, smart folks are improving the underlying (core) platform to make our lives easier. These improvements include additions to ECMAScript (the JavaScript language), ways to interact with the DOM, and even old friends like <code>XMLHttpRequest</code> and <code>&lt;input type="file"&gt;</code>. Here are just a few:
es: ¿No es sumamente complicado crear aplicaciones web? Por suerte, tipos muy inteligentes están mejorando la plataforma subyacente (central) para simplificarnos la vida. Esas mejoras incluyen adiciones a ECMAScript (el lenguaje de JavaScript), formas de interactuar con el DOM, e incluso viejos amigos como <code>XMLHttpRequest</code> y <code>&lt;input type="file"&gt;</code>. Aquí te mostramos algunos:

source: JavaScript <a href="https://developer.mozilla.org/en/JavaScript_typed_arrays">Typed Arrays</a>
es: <a href="https://developer.mozilla.org/en/JavaScript_typed_arrays">Conjuntos escritos</a> de JavaScript

source: New selectors: <a href="http://slides.html5rocks.com/#new-selectors"><code>querySelector()</code></a>, <a href="http://slides.html5rocks.com/#new-selectors"><code>querySelectorAll()</code></a>, <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#13"><code>matchesSelector()</code></a>
es: Nuevos selectores: <a href="http://slides.html5rocks.com/#new-selectors"><code>querySelector()</code></a>, <a href="http://slides.html5rocks.com/#new-selectors"><code>querySelectorAll()</code></a>, <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#13"><code>matchesSelector()</code></a>

source: Custom data-* attributes: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#12"><code>Element.dataset</code></a>
es: Atributos de datos personalizados*: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#12"><code>Element.dataset</code></a>

source: <a href="http://hacks.mozilla.org/2011/11/html5-context-menus-in-firefox-screencast-and-code/">Context menus</a>
es: <a href="http://hacks.mozilla.org/2011/11/html5-context-menus-in-firefox-screencast-and-code/">Menús contextuales</a>

source: <a href="http://webintents.org">Web Intents</a>
es: <a href="http://webintents.org">Intentos web</a>

source: These additions make apps easier to build, offload more work to the browser, and reduce your footprint (e.g. by removing the need for libraries that handle the same functionality).
es: Estas adiciones facilitan la creación de aplicaciones, la descarga de más trabajo al navegador y reducen el espacio ocupado (p. ej., al eliminar la necesidad de bibliotecas que cumplan la misma función).

source: With smarter APIs, we can build smarter apps
es: Con API más inteligentes podemos crear aplicaciones más inteligentes.

source: The platform includes APIs that give you greater insight into what is happening in your application. These APIs allow you to make smarter choices in your app, save battery/CPU, and create a better user experience.
es: La plataforma incluye API que te brindan más información sobre lo que ocurre en tu aplicación. Esas API te permiten tomar decisiones más inteligentes en tu aplicación, ahorrar batería/CPU y crear una mejor experiencia para el usuario.

source: Smarter animations: <code>window.requestAnimationFrame()</code>
es: Animaciones más inteligentes: <code>window.requestAnimationFrame()</code>

source: Form factor detection: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#16"><code>window.matchMedia()</code></a> and CSS media queries.</code>
es: Detección de diseño: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#16"><code>window.matchMedia()</code></a> y consultas de medios CSS.</code>

source: <a href="http://slides.html5rocks.com/#history-api">History API</a>
es: <a href="http://slides.html5rocks.com/#history-api">API Historial</a>

source: <a href="http://updates.html5rocks.com/2011/06/Page-Visibility-API-Have-I-got-your-attention">Page Visibility API</a>
es: <a href="http://updates.html5rocks.com/2011/06/Page-Visibility-API-Have-I-got-your-attention">API de visibilidad de páginas</a>

source: <a href="https://developer.mozilla.org/en/Online_and_offline_eventsion">online/offline events</a>
es: <a href="https://developer.mozilla.org/es/Online_and_offline_eventsion">eventos en línea/sin conexión</a>

source: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#28">Custom protocol/content handlers</a>
es: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#28">Controladores personalizados de protocolos/contenido</a>

source: Whitepaper on using the Page Visibility API.
es: Informe sobre el uso de la API de visibilidad de páginas

source: How to use the <code>rel='prerender'</code> attribute to prerender content in a background tab.
es: Cómo utilizar el atributo <code>rel='prerender'</code> para preprocesar contenido en una pestaña en segundo plano.

source: MDN reference on online/offline events.
es: Referencia de MDN en eventos en línea/sin conexión.

source: MDN reference on JS typed arrays.
es: Referencia MDN en conjuntos escritos de JS.

source: MDN refernce on <code>window.requestAnimationFrame()</code>
es: Referencia MDN en <code>window.requestAnimationFrame()</code>

source: MDN reference on the <code>window.history</code> API.
es: Referencia de MDN en la API <code>window.history</code>.

source: MDN documentation for <code>navigator.registerProtocolHandler()</code>.
es: Documentación de MDN para <code>navigator.registerProtocolHandler()</code>.

source: MDN documentation for <code>navigator.registerContentHandler()</code>.
es: Documentación de MDN para <code>navigator.registerContentHandler()</code>.

source: Allows apps to register an intent to handle common user actions.
es: Permite que las aplicaciones se registren en un intento de administrar acciones comúnes de los usuarios.

source: MDN reference on using features in <code>XMLHttpRequest2</code>.
es: Referencia de MDN acerca del uso de las características de <code>XMLHttpRequest2</code>.

source: "Web" and "online" are two closely associated terms, downright synonymous to many people. So why on earth would we talk about "offline" web technologies, and what does the term even mean?
es: "Web" y "en línea" son dos términos estrechamente relacionados; prácticamente sinónimos para muchas personas. Así que ¿por qué hablamos de tecnologías web "sin conexión" y qué significa el término?

source: HTML5 and related specs introduce a number of features to make offline web apps a reality:
es: Las especificaciones de HYML5 y otras especificaciones relacionadas presentan una cantidad de características que te permiten hacer realidad las aplicaciones web sin conexión:

source: application cache
es: caché de aplicación

source: web SQL &amp; indexed database
es: SQL web y base de datos indexada

source: online/offline events
es: eventos en línea/sin conexión

source: For a whirlwind overview of the offline landscape, consider the article <a href="/tutorials/offline/whats-offline/">"Offline": What does it mean and why should I care?</a>. These features can also be used to improve an application&rsquo;s performance by storing data in the cache or to make data persistent between user sessions and when reloading and restoring pages.
es: Para tener una visión general del panorama sin conexión, lee el artículo <a href="/tutorials/offline/whats-offline/">"Sin conexión": ¿Qué significa y por qué me involucra?</a>. Estas funciones también se pueden utilizar para mejorar el rendimiento de una aplicación mediante el almacenamiento de datos en caché o para que los datos sean persistentes entre sesiones de usuario, y al volver a cargar y restaurar páginas.

source: Presented by Nikolas Coukouma, January 5, 2011
es: Presentado por Nikolas Coukouma, el 05 de enero de 2011

source: The w3c spec has the strict details on how the cache.manifest and applicationCache APIs work.
es: La especificación W3C contiene los detalles estrictos sobre cómo trabajan las API de cache.manifest y applicationCache.

source: Mark Pilgrim dives into using the app cache in practice.
es: Mark Pilgrim se sumerge en el uso práctico de la caché de aplicaciones.

source: Mozilla Developer Center reference documentation and guides, covering online and offline events and app cache.
es: Guías y documentación de referencia del Centro del programador de Mozilla, que tratan sobre eventos en línea y sin conexión y la caché de la aplicación

source: Creating a todo list manager using localStorage, app cache and offline events. Putting everything together.
es: Creación de un administrador de listas de tareas pendientes con localStorage, caché de aplicaciones y eventos sin conexión. Unión de todos los elementos.

source: The app cache explained with solid examples showing different features and configurations in use.
es: El caché de la aplicación se explica con ejemplos sólidos que muestran las diferentes funciones y configuraciones en uso.

source: The C code used by Webkit for the app cache
es: El código C que utiliza WebKit para la caché de la aplicación

source: Web apps are now able to rival performance of native and desktop applications. By using a variety of techniques and technologies, your sites and apps can feel more responsive and your users will get more done. Performance is important, it's a constant theme across all aspects of your development and product.
es: Las aplicaciones web pueden ahora competir con el rendimiento de las aplicaciones nativas y de escritorio. Al utilizar una serie de tecnologías y técnicas, tus aplicaciones y sitios pueden ser más receptivos y los usuarios podrán realizar más acciones. El rendimiento es importante, ya que es un tema constante en todos los aspectos de tu desarrollo y de tus productos.

source: Writing fast and responsive apps isn't just important for your users, it's important for your bottom line. For example, <a href="http://googlewebmastercentral.blogspot.com/2010/04/using-site-speed-in-web-search-ranking.html">Google now incorporates site speed in page ranking</a>. <a href="http://exp-platform.com/Documents/2007-10EmetricsExperimenation.pdf">Amazon has found that every 100 ms increase in page load time decreased sales by 1%%</a>. Also, <a href="http://exp-platform.com/Documents/2007-10EmetricsExperimenation.pdf">Microsoft found that slowing a page by 2 seconds decreased ad clicks by 4%%</a>.
es: Escribir aplicaciones rápidas y receptivas no solo es importante para los usuarios, sino también para tu beneficio. Por ejemplo, <a href="http://googlewebmastercentral.blogspot.com/2010/04/using-site-speed-in-web-search-ranking.html">Google ahora incluye la velocidad del sitio en la clasificación de páginas</a>. <a href="http://exp-platform.com/Documents/2007-10EmetricsExperimenation.pdf">Amazon descubrió que cada 100 milisegundos de aumento en el tiempo de carga de las páginas, las ventas se reducen en un 1%%</a>. Asimismo, <a href="http://exp-platform.com/Documents/2007-10EmetricsExperimenation.pdf">Microsoft descubrió que ralentizar una página 2 segundos reduce los clic en los anuncios un 4%%</a>.

source: Web app optimization cross cuts all aspects of development, from the server to the network to the client. Focusing on performance is critical to success.
es: La optimización de las aplicaciones web atraviesa todos los aspectos de la programación, desde el servidor a la red y al cliente. Centrarse en el rendimiento es fundamental para el éxito.

source: Store locally.
es: Almacenar de forma local

source: Data stored on the client is quicker to access than data stored on the server. Also, data stored closer to the calculation is quicker to access.
es: Se accede más rápido a los datos almacenados en el cliente que a los almacenados en el servidor. Además, los datos almacenados más cerca de los cálculos son de más rápido acceso.

source: Process in the background.
es: Proceso en segundo plano

source: Anything that doesn't help the user see a response to their action should be performed in the background.
es: Cualquier proceso que no ayude al usuario a visualizar una respuesta a su acción se debe realizar en segundo plano.

source: Minimize connections.
es: Minimizar conexiones.

source: Each connection requires work for setup and teardown.
es: Cada conexión requiere un trabajo de instalación y desmontaje.

source: Decrease bandwidth.
es: Disminuir el ancho de banda

source: Less bandwidth means a faster response.
es: Un menor ancho de banda supone una respuesta más rápida.

source: HTTP caching
es: Caché en HTTP

source: Allow clients and servers to reduce connections and bandwidth.
es: Permite a los clientes y servidores reducir las conexiones y el ancho de banda.

source: HTTP caching servers
es: Servidores de caché de HTTP

source: Servers like <a href="http://www.varnish-cache.org/">Varnish</a> and <a href="http://www.squid-cache.org/">Squid</a> can cache your content.
es: Los servidores como <a href="http://www.varnish-cache.org/">Varnish</a> y <a href="http://www.squid-cache.org/">Squid</a> pueden almacenar tu contenido en la caché.

source: Memcache
es: Memcaché

source: Efficient server side storage and retrieval of key/value data
es: Almacenamiento eficiente del servidor y recuperación de datos clave/valiosos

source: Web workers
es: Trabajadores web

source: Run JavaScript in the background, in parallel with the main window
es: Ejecutar JavaScript en segundo plano, de forma paralela a la ventana principal

source: Web sockets
es: Enchufes web

source: Efficient bi-directional streaming communication
es: Comunicación de flujo bidireccional eficaz

source: Local storage
es: Almacenamiento local

source: Client side key/value data storage
es: Almacenamiento de datos de clave/valor del cliente

source: Indexed database
es: Base de datos indexada

source: Client side simple object storage
es: Almacenamiento de objetos simples del cliente

source: App cache
es: Caché de la aplicación

source: Caching web app assets locally for offline use
es: Almacenamiento en caché de los activos de aplicaciones web a nivel local para su uso sin conexión

source: CSS3 transitions and animations
es: Transiciones y animaciones CSS3

source: Native (and possibly hardware accelerated) property changes for elements
es: Cambios nativos (y, posiblemente, con aceleración de hardware) en las propiedades de los elementos

source: CSS sprites
es: Sprites CSS

source: Combining many small images into one image, reduce downloads
es: Combinar muchas imágenes pequeñas en una sola imagen, reducir las descargas

source: Link prefetching
es: Obtención previa del vínculo

source: Ask the browser to download other pages in the background
es: Solicita al navegador que descargue otras páginas en segundo plano.

source: Native client
es: Cliente nativo

source: Run native code (C/C++) in a browser sandbox
es: Ejecutar código nativo (C/C++) en la zona de pruebas de un navegador

source: HTTP persistent connections
es: Conexiones HTTP persistentes

source: send multiple resources over the same connection
es: enviar múltiples recursos con la misma conexión

source: Web fonts
es: Fuentes web

source: natively render text instead of download images
es: representar el texto de forma nativa en vez de descargar imágenes

source: Data URI
es: Datos URI
