Repository: baonlq/html5rocks
Catalog: www.html5rocks.com/conf/locale/*/LC_MESSAGES/django.po
Languages: es

source: Embed binary data such as images into HTML, reducing HTTP requests
es: Insertar datos binarios, como imágenes en HTML, reduciendo las solicitudes de HTTP

source: HTTP Caching
es: Almacenamiento caché HTTP

source: Use If-Modified-Since and ETags to reduce content over the wire.
es: Utiliza etiquetas Si-Modificado-Desde y etiquetas electrónicas para reducir el contenido a través del cable.

source: Data caching
es: Caché de datos

source: Use systems like Memcache for frequently accessed data.
es: Utiliza sistemas como la memoria caché para los datos de acceso frecuente.

source: Local data caching
es: Almacenamiento en caché de datos locales

source: Put data on the client for faster access.
es: Incluye datos en el cliente para un acceso más rápido.

source: Content delivery networks
es: Redes de distribución de contenido

source: Place the content closer to the client with a CDN.
es: Coloca el contenido más cerca del cliente con una CDN.

source: Efficient data retrieval
es: Recuperación eficiente de datos

source: Minimize SQL calls, reduce joins, retrieve via an index.
es: Minimizar las llamadas SQL, reducir uniones, recuperar a través de un índice

source: Pre-calculating results
es: Precálculo de resultados

source: Denormalize or pre-calculate frequently retrieved data.
es: Desnormalizar o calcular previamente los datos recuperados con frecuencia.

source: Minification
es: Minificación

source: Shrink your JavaScript, CSS, and even HTML files.
es: Reducir tu código JavaScript, CSS e, incluso, los archivos HTML

source: Compression
es: Compresión

source: Compress your assets via HTTP's Accept-Encoding.
es: Comprime tus elementos a través del encabezado Accept-Encoding de HTTP.

source: Asynchronous callbacks
es: Devoluciones de llamada asíncronas

source: Defer the work, get notified when it&rsquo;s done.
es: Difiere el trabajo y recibe una notificación cuando esté listo.

source: Hardware acceleration
es: Aceleración de hardware

source: Browsers are now using the GPU for things like canvas and transforms.
es: Ahora los navegadores utilizan la GPU para elementos como el lienzo y las transformaciones.

source: Moving calculations close to data
es: Aproximación de los cálculos a los datos

source: Data is bigger than algorithms, move code and not data.
es: El tamaño de los datos es superior al de los algoritmos. Debes mover el código, no los datos.

source: Profiling
es: Perfilado

source: Use tools to understand and collect real life data. Measure, don&rsquo;t guess.
es: Utiliza herramientas para entender y recopilar datos de la vida real. Mide, no adivines.

source: Place many images into one file, minimizing HTTP requests.
es: Coloca muchas imágenes en un archivo reduciendo las solicitudes HTTP.

source: Image optimization
es: Optimización de imagen

source: Compress your images, pick the right format for the job.
es: Comprime las imágenes y escoge el formato correcto para el trabajo.

source: Specify image width and heights
es: Especificar el ancho y alto de la imagen

source: Tell the browser how to render around images before they are downloaded.
es: Indica al navegador cómo representar las imágenes antes de que se descarguen.

source: Place JavaScript at the bottom of your HTML
es: Coloca JavaScript en la parte inferior de tu HTML.

source: Let the page download and begin rendering.
es: Deja que la página se descargue y comience la representación.

source: Rendering on the client
es: Representación en el cliente

source: Use canvas to draw images, or web fonts to render text, instead of downloading assets.
es: Utiliza el lienzo para dibujar imágenes o fuentes web para representar texto, en lugar de descargar elementos.

source: Read 'High Performance Web Sites' and 'Even Faster Web Sites'
es: Lee "Sitios web de alto rendimiento" y "Sitios web aún más rápido".

source: Covers web app performance in great detail
es: Trata el rendimiento de las aplicaciones web en detalle.

source: Developer tools for <a href="http://www.chromium.org/devtools">Chrome</a> and <a href="http://developer.apple.com/technologies/safari/developer-tools.html">Safari</a>
es: Herramientas para programadores de <a href="http://www.chromium.org/devtools">Chrome</a> y <a href="http://developer.apple.com/technologies/safari/developer-tools.html">Safari</a>

source: Peer into requests, walk the DOM, set JavaScript breakpoints, get behind the scenes
es: Mira en las solicitudes, recorre el DOM, establece puntos de quiebre para JavaScript, colócate detrás de la escena.

source: <a href="http://www.opera.com/dragonfly/">Dragonfly</a> for Opera
es: <a href="http://www.opera.com/dragonfly/">Dragonfly</a> para Opera

source: Similar to Webkit Developer Tools, but for Opera
es: Similar a las herramientas para desarrolladores de Webkit pero para Opera

source: <a href="http://getfirebug.com/">Firebug</a> for Firefox
es: <a href="http://getfirebug.com/">Firebug</a> para Firefox

source: Similar to Opera Dragonfly, but for Firefox.
es: Parecido a Opera Dragonfly, pero para Firefox

source: <a href="http://www.html5rocks.com/tutorials/developertools/auditpanel/">Audit panel</a> in the Developer tools
es: <a href="http://www.html5rocks.com/tutorials/developertools/auditpanel/">Panel de auditoría</a> en las herramientas para programadores

source: Get suggestions for speeding up your web app
es: Obtén sugerencias para acelerar tu aplicación web.

source: <a href="http://code.google.com/webtoolkit/speedtracer/">Speedtracer</a> - not just for GWT, check out the <a href="http://www.igvita.com/2010/07/19/speed-tracer-server-side-tracing-with-rack/">Ruby plugin</a>
es: <a href="http://code.google.com/webtoolkit/speedtracer/">Speedtracer</a>: no solo para GWT, echa un vistazo al <a href="http://www.igvita.com/2010/07/19/speed-tracer-server-side-tracing-with-rack/">complemento Ruby</a>

source: Identify and fix performance problems in your web app
es: Identifica y corrige problemas de rendimiento en tu aplicación web

source: <a href="http://developer.yahoo.com/yslow/">YSlow</a> for Firebug
es: <a href="http://developer.yahoo.com/yslow/">YSlow</ a> para Firebug

source: Like the Developer Tools' Audit Panel, but for Firefox
es: Como las herramientas para programadores Audit Panel, pero para Firefox

source: <a href="http://code.google.com/closure/compiler/">Closure JavaScript compiler</a>
es: <a href="http://code.google.com/closure/compiler/">Compilador de cierre de JavaScript</a>

source: Minify, reduce, and obfuscate your JavaScript
es: Minifica, reduce y ofusca tu código JavaScript.

source: <a href="http://developer.yahoo.com/yui/compressor/">YUI Compressor</a>
es: <a href="http://developer.yahoo.com/yui/compressor/">Compresor YUI</a>

source: Minify and obfuscate your JavaScript and CSS
es: Minifica y ofusca tu código JavaScript y CSS.

source: An industry collaboration providing the testing infrastructure for testing from around the globe
es: Una colaboración de la industria que proporciona la infraestructura para pruebas de todo el mundo

source: With the introduction of CSS3 it has never been easier to create rich and beautiful sites and applications in HTML. There are many new technologies and extensions to CSS3 including: <a href="http://www.w3.org/TR/css3-2d-transforms">2D Transformations</a>, <a href="http://www.w3.org/TR/css3-transistion">Transitions</a>, <a href="http://www.w3.org/TR/css3-3d-transforms">3D Transforms</a> and <a href="http://www.w3.org/TR/css3-webfonts">WebFonts</a> to name just a few.
es: Con la introducción de CSS3, nunca ha sido más fácil crear aplicaciones y sitios fantásticos y completos en HTML. Hay muchas tecnologías y extensiones nuevas de CSS3, entre las que se incluyen: <a href="http://www.w3.org/TR/css3-2d-transforms">transformaciones 2D</a>, <a href="http://www.w3.org/TR/css3-transistion">transiciones</a>, <a href="http://www.w3.org/TR/css3-3d-transforms">transformaciones 3D</a> y <a href="http://www.w3.org/TR/css3-webfonts">fuentes web</a>, por mencionar solo algunas.

source: You can create rich user experiences with no coding effort required, just simply apply a little CSS to your existing applications.
es: Puedes crear experiencias de usuario enriquecedoras y sin esfuerzos de codificación, simplemente aplica un poco de CSS a tus aplicaciones existentes.

source: CSS3 Transformations allow you to apply rotations, scales, skews and translations to any DOM element with simple styles.
es: Las transformaciones CSS3 te permiten aplicar rotaciones, escalas, ángulos oblicuos y traducciones a cualquier elemento DOM con estilos simples.

source: Transitions allow you to specify how the style on a DOM element will animate between transformed states. For example, you can animate the background color when the user hovers over an element. <strong>Hover over this code!</strong>
es: Las transiciones te permiten especificar cómo el estilo en un elemento DOM se animará entre estados transformados. Por ejemplo, puedes animar el color de fondo cuando el usuario se desplaza sobre un elemento. <strong>¡Desplázate sobre este código!</strong>

source: Applying 3D transforms is simple too. Just specify the transformation in 3d co-ordinates and you are ready. <strong>Hover over this code!</strong>
es: Aplicar las transformaciones en 3D es muy simple. Basta con especificar las coordenadas para la transformación en 3D y listo. <strong>Desplázate sobre este código</ strong>.

source: A list of the current status of the CSS3 specifications.
es: Una lista del estado actual de las especificaciones CSS3

source: This W3C specification defines the new selectors available to developers.
es: Esta especificación W3C define los nuevos selectores disponibles para los programadores.

source: This W3C specification defines how rotations, transformations, skews and scaling should be applied to DOM elements in 2 dimensions.
es: Esta especificación W3C define la forma en que las rotaciones, transformaciones, ángulos y escalas deben aplicarse a los elementos DOM en 2 dimensiones.

source: This W3C specification defines how 3d transformations should be applied to DOM elements.
es: Esta especificación W3C define cómo deben aplicarse las transformaciones en 3D a los elementos DOM.

source: This W3C specification defines how properties should be animated between states.
es: Esta especificación W3C define cómo se deben animar las propiedades entre estados.

source: This W3C specification defines the new animation properties available.
es: Esta especificación W3C define las nuevas propiedades de animación disponibles.

source: Semantics is one of the most distinctive features of the Web Platform versus other application platforms. Developers usually ignore or de-prioritize such feature but the mastery of it can bring many benefits to our projects.
es: La semántica es una de las características más distintivas de la plataforma web contra las plataformas de aplicación. Los programadores suelen ignorar o no dar prioridad a esta característica, pero el dominio de la misma puede traer muchos beneficios a nuestros proyectos.

source: The Web is text and text has a meaning. Ultimately the content that our browsers read is pure text. Web sites and web applications have been created in an ecosystem where text based content is linkable, searchable and mashable. In the open web scenario our content can be shown, fed and remixed by third parties, search engines and accessibility tools. All these benefits don't come for free. Automated tools can only do half of the job at recognizing the nature of the content. The better job the developer does at marking the right semantics of the content the easier will be for the rest of the agents to deal with it. HTML5 provides a series of tools to make developers life easier too:
es: La Web es texto y el texto tiene un significado. En definitiva, el contenido que nuestros navegadores leen es puro texto. Los sitios web y las aplicaciones web se crearon en un ecosistema donde el contenido basado en texto se puede vincular, buscar y combinar. En el escenario abierto, terceros, motores de búsqueda y herramientas de accesibilidad pueden mostrar, proporcionar y recombinar nuestro contenido. Esos beneficios no son gratuitos. Las herramientas automatizadas solo pueden realizar la mitad del trabajo al reconocer la naturaleza del contenido. Cuanto mejor sea el trabajo del programador en la marcación de la semántica correcta del contenido, más fácil será para el resto de los agentes trabajar con él. HTML5 ofrece una serie de herramientas que también facilitan el trabajo de los programadores:

source: New media elements.
es: Nuevos elementos de medios.

source: New structural elements.
es: Nuevos elementos estructurales.

source: New semantics for internationalization.
es: Nueva semántica para la internacionalización.

source: New link relation types.
es: Nuevos tipos de relaciones entre vínculos.

source: New attributes.
es: Nuevos atributos.

source: New form types.
es: Nuevos formularios

source: New microdata syntax for additional semantics.
es: Nueva sintaxis de microdatos para proporcionar semántica adicional.

source: To enable sectioning markup in old IE.
es: Para permitir la marcación de secciones en el viejo IE.

source: When web developers think of storing anything about the user, they immediately think of uploading to the server. HTML5 changes that, as there are now several technologies allowing the app to save data on the client device. It might also be sync'd back to the server, or it might only ever stay on the client: that's down to you, the developer.
es: Cuando los programadores web piensan en almacenar información sobre el usuario, inmediatamente piensan en subir los cambios de HTML5 al servidor. Como en la actualidad hay varias tecnologías que le permiten a la aplicación guardar los datos en el dispositivo del cliente, estos cambios también pueden sincronizarse de vuelta al servidor, o pueden permanecer siempre en el cliente: eso depende exclusivamente de ti, el programador.

source: There are several reasons to use client-side storage. First, you can make your app work when the user is offline, possibly sync'ing data back once the network is connected again. Second, it's a performance booster; you can show a large corpus of data as soon as the user clicks on to your site, instead of waiting for it to download again. Third, it's an easier programming model, with no server infrastructure required. Of course, the data is more vulnerable and the user can't access it from multiple clients, so you should only use it for non-critical data, in particular cached versions of data that's also "in the cloud". See <a href="/tutorials/offline/whats-offline/">"Offline": What does it mean and why should I care?</a> for a general discussion of offline technologies, of which client-side storage is one component.
es: Existen varias razones para usar el almacenamiento del cliente. En primer lugar, puedes hacer que tu aplicación funcione cuando el usuario no está conectado, posiblemente, sincronizando datos cuando la red vuelva a estar conectada. En segundo lugar, aumenta el rendimiento; puedes mostrar una gran cantidad de datos en cuanto el usuario hace clic en tu sitio, en vez de esperar a que vuelva a descargarse. En tercer lugar, es un modelo de programación más fácil, que no necesita infraestructura de servidor. Por supuesto, los datos son más vulnerables y el usuario no puede acceder a estos desde varios clientes, por lo tanto solo deberías utilizarlo para datos que no sean críticos, en versiones de almacenamiento caché de datos específicos que también estén "en la nube". Consulta <a href="/tutorials/offline/whats-offline/">"Sin conexión": ¿Qué significa y por qué me involucra?</a> para obtener información general sobre las tecnologías sin conexión, de las cuales el almacenamiento del cliente es un componente.

source: While Web SQL Database is supported in Chrome, Safari &amp; Opera, Firefox and IE are unlikely to support it any time soon (Mozilla is <a href="http://hacks.mozilla.org/2010/06/beyond-html5-database-apis-and-the-road-to-indexeddb/">philosophically opposed</a>). Indexed Database has an early implementation in Firefox 4.0 Beta and Chrome dev channel. There's a good chance all browsers will support it in the future, but that's not yet clear.
es: Mientras que la base de datos web de SQL es compatible con Chrome, Safari y Opera, es poco probable que Firefox e IE la admitan en un futuro cercano (Mozilla se <a href="http://hacks.mozilla.org/2010/06/beyond-html5-database-apis-and-the-road-to-indexeddb/">opone filosóficamente</a>). La base de datos indexada tiene una implementación temprana en Firefox 4.0 Beta y en el canal de desarrolladores de Chrome. Existe una gran posibilidad de que todos los navegadores la admitan en el futuro, pero aún no es seguro.

source: <a href="http://dev.w3.org/html5/webstorage/">Web Storage</a> simply provides a key-value mapping, e.g. <code>localStorage["name"] = username;</code>. Unfortunately, present implementations only support string-to-string mappings, so you need to serialise and de-serialise other data structures. You can do so using <code>JSON.stringify()</code> and <code>JSON.parse()</code>.
es: El <a href="http://dev.w3.org/html5/webstorage/">almacenamiento web</a> brinda una asignación de clave y valor, por ejemplo <code>localStorage["name"] = username;</code>. Lamentablemente, las implementaciones actuales solo admiten asignaciones de cadena a cadena, por lo que necesitas serializar y deserializar otras estructuras de datos. Puedes hacerlo al utilizar <code>JSON.stringify()</code> y <code>JSON.parse()</code>.

source: <a href="http://dev.w3.org/html5/webdatabase/">Web SQL Database</a> gives you all the power - and effort - of a structured SQL relational database.
es: La <a href="http://dev.w3.org/html5/webdatabase/">base de datos web de SQL</a> te brinda toda la potencia -y el esfuerzo- de una base de datos relacional de SQL.

source: <a href="http://www.w3.org/TR/IndexedDB/">Indexed Database</a> is somewhere in between Web Storage and Web SQL Database. Like Web Storage, it's a straightforward key-value mapping, but it supports indexes like those of relational databases, so searching objects matching a particular field is fast; you don't have to manually iterate through every object in the store.
es: La <a href="http://www.w3.org/TR/IndexedDB/">base de datos indexada</a> es una mezcla del almacenamiento web y la base de datos web de SQL. Al igual que el almacenamiento web, esta es una asignación simple de clave y valor, pero admite índices como los de las bases de datos relacionales, por lo que buscar objetos que coincidan con un campo determinado es rápido. Además, no tienes que repetir manualmente la acción en cada objeto de la tienda.

source: <a href="http://www.w3.org/TR/FileAPI/">File Access</a> is an API for reading file content in JavaScript. Given a set of files the user has added to a "file" input element, you can read the content of the file or reference it as a URL, e.g. if the user has specified an image file, you can show the image. There are also proposals underway for file writing capabilities.
es: El <a href="http://www.w3.org/TR/FileAPI/">acceso a archivos</a> es una API para leer el contenido de un archivo en JavaScript. En función de un conjunto de archivos que el usuario ha agregado a un elemento de entrada "archivo", puedes leer el contenido del archivo o hacer referencia a él como una URL (por ejemplo, si el usuario ha especificado un archivo de imagen, puedes mostrar la imagen). También se están desarrollando algunas propuestas relacionadas con funciones de escritura de archivos.

source: For a detailed comparison of client-side storage techniques with code demos, see our <a href="/tutorials/offline/storage/">Client-Side Storage</a> article.
es: Para una comparación detallada de las técnicas de almacenamiento del cliente con demostraciones de código, consulta nuestro artículo <a href="/tutorials/offline/storage/">Almacenamiento del cliente</a>.

source: Mark Pilgrim dives into using the storage APIs.
es: Mark Pilgrim explica en detalle cómo utilizar las API de almacenamiento.

source: Mozilla Developer Center on Web Storage.
es: Centro del programador de Mozilla para el almacenamiento web

source: Mozilla Developer Center on IndexedDB.
es: Centro del programador de Mozilla en la base de datos indexados

source: Creating a todo list manager using localStorage, app cache and offline events.
es: Creación de un administrador de listas de tareas pendientes utilizando el almacenamiento local, la caché de la aplicación y eventos sin conexión.

source: Mozilla explains its views on Web SQL Database and Indexed Database
es: Mozilla explica sus puntos de vista sobre la base de datos web de SQL y las bases de datos indexadas.

source: Frameworks
es: Marcos

source: Development Tools
es: Herramientas de programación

source: Compatibility
es: Compatibilidad

source: Inspiration
es: Inspiración

source: Filtering by tag
es: Filtrar por etiqueta

source: [Clear filter]
es: [Eliminar filtro]

source: Null character in input stream, replaced with U+FFFD.
es: Carácter nulo en el flujo de entrada, sustituido por U+FFFD

source: Invalid codepoint in stream.
es: Punto de código no válido en el flujo

source: Solidus (/) incorrectly placed in tag.
es: Diagonal (/) colocada incorrectamente en la etiqueta

source: Incorrect CR newline entity, replaced with LF.
es: Entidad de nueva línea CR incorrecta, reemplazada por LF.

source: Entity used with illegal number (windows-1252 reference).
es: Entidad utilizada con número no permitido (referencia windows-1252)

source: Numeric entity couldn't be converted to character (codepoint U+%(charAsInt)08x).
es: La entidad numérica no se pudo convertir a un carácter (punto de código U+%(charAsInt)08x).

source: Numeric entity represents an illegal codepoint: U+%(charAsInt)08x.
es: La entidad numérica representa un punto de código ilegal: U+%(charAsInt)08x.

source: Numeric entity didn't end with ';'.
es: La entidad numérica no terminaba con ';'.

source: Numeric entity expected. Got end of file instead.
es: Entidad numérica esperada. En su lugar, se obtuvo el final del archivo.

source: Numeric entity expected but none found.
es: Entidad numérica esperada, pero no encontrada

source: Named entity didn't end with ';'.
es: La entidad nombrada no termina con ";".

source: Named entity expected. Got none.
es: Entidad nombrada esperada. No se obtuvo ninguna.

source: End tag contains unexpected attributes.
es: La etiqueta de cierre contiene atributos inesperados.

source: Expected tag name. Got '>' instead.
es: Nombre de la etiqueta esperado. Se obtuvo ">" en su lugar.

source: Expected tag name. Got '?' instead. (HTML doesn't support processing instructions.)
es: Nombre esperado de la etiqueta. Se obtuvo '?' en su lugar. (HTML no admite instrucciones de procesamiento).

source: Expected tag name. Got something else instead
es: Nombre de etiqueta esperado. Se obtuvo un elemento diferente.

source: Expected closing tag. Got '>' instead. Ignoring '</>'.
es: Etiqueta de cierre esperada. Se obtuvo ">" en su lugar. Ignorando "</>".

source: Expected closing tag. Unexpected end of file.
es: Etiqueta de cierre esperada. Fin de archivo inesperado.

source: Expected closing tag. Unexpected character '%(data)s' found.
es: Etiqueta de cierre esperada. Carácter inesperado "%(data)s" encontrado.

source: Unexpected end of file in the tag name.
es: Fin de archivo inesperado en el nombre de la etiqueta

source: Unexpected end of file. Expected attribute name instead.
es: Fin de archivo inesperado. Se esperaba el nombre del atributo en su lugar.

source: Unexpected end of file in attribute name.
es: Fin de archivo inesperado en el nombre del atributo
