Repository: baonlq/html5rocks
Catalog: www.html5rocks.com/conf/locale/*/LC_MESSAGES/django.po
Languages: es

source: this feature
es: esta función

source: HTML5Rocks - Tutorials & Updates
es: HTML5Rocks: Tutoriales y actualizaciones

source: Take a guided tour through code that uses HTML5.
es: Realiza una visita guiada a por el código que utiliza HTML5.

source: Sorry, this article isn't available in your native language; we've redirected you to the English version.
es: Lo sentimos, este artículo no está disponible en tu idioma nativo, por lo que te hemos redireccionado a la versión en inglés.

source: Home
es: Inicio

source: Community
es: Comunidad

source: The HTML5 community is getting bigger and bigger. Here you will find some resources to be up to date about the latest HTML5 news as well as to be able to discuss with developers and engineers the experimental features and proposals around the standards and browser implementations.
es: La comunidad de HTML5 crece cada vez más. Aquí encontrarás algunos recursos para estar al día sobre las últimas noticias de HTML5; además, podrás hablar con los programadores e ingenieros sobre las funciones experimentales y las propuestas relacionadas con las normas e implementaciones del navegador.

source: Forum
es: Foro

source: Events
es: Eventos

source: IRC Channel
es: Canal de IRC

source: HTML5 conferences (Lanyrd)
es: Conferencias HTML5 (Lanyrd)

source: HTML5 Meetup Groups
es: Grupos de encuentro de HTML5

source: Google Developer Events Calendar
es: Calendario de eventos para programadores de Google

source: HTML5 Events
es: Eventos HTML5

source: A resource for open web HTML5 developers
es: Un recurso para los programadores de HTML5 de web abierta

source: Latest Updates
es: Últimas actualizaciones

source: loading feed...
es: Cargando feeds...

source: Tweet
es: Twittear

source: See more &rarr;
es: Ver más →

source: Welcome to HTML5ROCKS
es: Te damos la bienvenida a HTML5ROCKS

source: What kind of HTML dev do you think you are?
es: ¿Qué tipo de programador HTML crees que eres?

source: HTML5 is the ubiquitous platform for the web. Whether you're a mobile web developer, an enterprise with specific business needs, or a serious game dev looking to explore the web as a new platform, HTML5 has something for you! Choose your path:
es: HTML5 es la plataforma ideal para la Web. Ya sea que seas un programador web para celulares, una empresa con necesidades comerciales específicas, o un programador de juegos profesional que deseas explorar la Web como una nueva plataforma, ¡HTML5 tiene algo para ti! Elige tu camino:

source: Mobile
es: Dispositivos móviles

source: Web developers can use the same set of technologies they know and love to build rich web applications that work across different device types.
es: Los programadores web pueden utilizar el mismo conjunto de tecnologías que ya conocen y adoran para crear aplicaciones web enriquecidas que funcionen en diferentes tipos de dispositivos.

source: Gaming
es: Juegos

source: High performance 2D/3D graphics, offline asset storage, rich audio APIs, and socket-based networking let you create compelling modern games and reach users like never before.
es: Gráficos 2D y 3D de alto rendimiento, almacenamiento de recursos sin conexión, API de audio enriquecidas y conexiones de red basadas en conectores te permiten crear juegos modernos impactantes y llegar a los usuarios como nunca antes.

source: Business
es: Negocios

source: HTML5 brings substantial benefits for companies that no other IT model can &ndash; in simplicity, cost, security, flexibility and mobility.
es: HTML5 aporta beneficios importantes a las empresas que no puede ofrecer ningún otro modelo de TI, en sencillez, costo, seguridad, flexibilidad y movilidad.

source: Or get straight to the tech!
es: O pasa directamente a los aspectos técnicos.

source: HTML5 Features
es: Características de HTML5

source: HTML5 is making the web platform more powerful in a number of different areas. Try learning by major HTML5 feature groups.
es: HTML5 está fortaleciendo la plataforma web en diferentes áreas. Aprende a través de los principales grupos de funciones de HTML5.

source: Offline
es: Sin conexión

source: Storage
es: Almacenamiento

source: Connectivity
es: Conectividad

source: File Access
es: Acceso a los archivos

source: Semantics
es: Semántica

source: 3D/Graphics
es: 3D/Gráficos

source: Presentation
es: Presentación

source: Performance
es: Rendimiento

source: Nuts &amp; Bolts
es: Aspectos básicos

source: Why HTML5?
es: ¿Por qué HTML5?

source: Why you should care.
es: ¿Por qué debería interesarte?

source: HTML5 introduces many cutting-edge features that enable developers to create web apps&hellip;
es: HTML5 presenta muchas características de vanguardia que permiten a los programadores crear aplicaciones web &hellip;

source: Updates
es: Actualizaciones

source: Learn what's new.
es: Conoce las novedades.

source: Articles, tutorials, case studies, and demos that show you how to use HTML5 features.
es: Artículos, tutoriales, estudios de casos y demostraciones que te muestran cómo utilizar las características de HTML5.

source: Resources
es: Recursos

source: All HTML5, all the time.
es: Todos los HTML5, todo el tiempo.

source: Cultivated list of additional resources to help you on your HTML5 learning voyage.
es: Lista extensiva de recursos adicionales para ayudarte en tu viaje de aprendizaje de HTML5.

source: Contributors
es: Colaboradores

source: HTML5Rocks is <a href="http://code.google.com/p/html5rocks/" rel="external">open source</a> and community driven. Tweak the code or <a href="http://code.google.com/p/html5rocks/wiki/ContributorsGuide" rel="external">contribute</a> a new tutorial. We'd love to have your help and expertise!
es: HTML5Rocks tiene formato de <a href="http://code.google.com/p/html5rocks/" rel="external">código abierto</a> y está orientado a la comunidad. Ajusta el código o <a href="http://code.google.com/p/html5rocks/wiki/ContributorsGuide" rel="external">aporta</a> un nuevo tutorial. Tu ayuda y experiencia serán muy bien recibidas.

source: Privacy Policy
es: Política de privacidad

source: HTML5 Rocks <span>Privacy Policy</span>
es: <span>Política de privacidad</span> de HTML5 Rocks

source: The HTML5ROCKS website (the "Website") is hosted by Google and, as such, for the purposes of personal information, the Website operates as any other Google service. Google's Privacy Policy is available at <a href="http://www.google.com/privacy.html">http://www.google.com/privacy.html</a>.</p>
es: El sitio web HTML5ROCKS (el "sitio web") está alojado en Google y, como tal, a los efectos de la información personal, funciona como cualquier otro servicio de Google. La Política de privacidad de Google está disponible en <a href="http://www.google.com/privacy.html">http://www.google.com/privacy.html</a>.</p>

source: Author Profiles
es: Perfiles de autor

source: Authors
es: Autores

source: Our honorable contributors.
es: Nuestros honorables colaboradores

source: You can <a href="http://twitter.com/ChromiumDev">follow us on Twitter</a>, read the <a href="/%(LANGUAGE_CODE)s/tos">Terms of Service</a> or <a href="/%(LANGUAGE_CODE)s/privacy">Privacy Policy</a>, or <a href="http://code.google.com/p/html5rocks/issues/entry">report a bug or request a feature</a>. <small>This site contains information on APIs that are not part of the W3C HTML5 specification.</small>
es: Puedes <a href="http://twitter.com/ChromiumDev">seguirnos en Twitter</a>, leer las <a href="/%(LANGUAGE_CODE)s/tos">Condiciones del servicio</a> o la <a href="/%(LANGUAGE_CODE)s/privacy">Política de privacidad</a>, o <a href="http://code.google.com/p/html5rocks/issues/entry">informar un error o solicitar una función</a>. <small>Este sitio contiene información sobre API que no forman parte de la especificación HTML5 de W3C.</small>

source: <strong>HTML5 Rocks</strong> is a <strong><img src="/static/images/google_logo_small.png" alt="Google logo" title="Google"></strong> project.
es: <strong>HTML5 Rocks</strong> es un proyecto de <strong><img src="/static/images/google_logo_small.png" alt="Google logo" title="Google"></strong>.

source: Contributions
es: Contribuciones

source: Contribute
es: Contribuir

source: This site and all of its tutorials and presentation slides are <a href="http://code.google.com/p/html5rocks/" rel="external">open source projects</a>. Tweak the code or <a href="http://code.google.com/p/html5rocks/wiki/ContributorsGuide" rel="external">contribute</a> new guides!
es: Este sitio y todos sus tutoriales y diapositivas son <a href="http://code.google.com/p/html5rocks/" rel="external">proyectos de código abierto</a>. Ajusta el código o <a href="http://code.google.com/p/html5rocks/wiki/ContributorsGuide" rel="external">aporta</a> nuevas guías.

source: Ready to develop in HTML5 but worried about supporting older versions of Internet Explorer? Learn how <a href="http://code.google.com/chrome/chromeframe/">Google Chrome Frame</a> can help. It's easy to include on your site:
es: ¿Estás listo para programar en HTML5, pero te preocupa la compatibilidad con versiones anteriores de Internet Explorer? Conoce cómo <a href="http://code.google.com/chrome/chromeframe/">Google Chrome Frame</a> puede ayudarte. Es fácil incluirlo en tu sitio:

source: Reference
es: Referencia

source: Visual timeline of HTML5 feature support.
es: Línea de tiempo visual para las funciones admitidas de HTML5

source: Up to date HTML5 feature browser support reference.
es: Referencias actualizadas de la función HTML5 y la admisión de los navegadores

source: Series of browser tests to evaluate feature support.
es: Serie de pruebas del navegador para evaluar la compatibilidad de las funciones

source: Detailed browser feature support reference.
es: Referencia detallada de compatibilidad con la función del navegador

source: A quick overview of scope and support.
es: Una breve descripción general sobre el alcance y la compatibilidad

source: Follow the engineering effort for cutting edge support from the Chrome team.
es: Sigue el esfuerzo de ingeniería del equipo de Chrome para una asesoría de última generación.

source: If the Wikipedia says it then it must be true.
es: Si Wikipedia lo dice, entonces debe ser cierto.

source: Detailed table of ES5 support across browsers.
es: Tabla detallada de compatibilidad ES5 en navegadores

source: Results of DOM and CSS properties tests in major browsers.
es: Los resultados de las propiedades DOM y CSS se prueban en los principales navegadores.

source: Documentation
es: Documentación

source: Lightweight version of the W3c spec, perfect for web developers.
es: Versión liviana de la especificación W3C, ideal para programadores web

source: Learn HTML5 and have a laugh at the same time.
es: Aprende sobre HTML5 y diviértete al mismo tiempo.

source: Excellent WebKit-oriented development documentation.
es: Excelente documentación de desarrollo orientada al WebKit

source: Excellent documentation and guides.
es: Excelente documentación y guías

source: Working draft spec of everything under the larger HTML5 umbrella.
es: Especificación de borrador de todo lo que engloba el gran lenguaje HTML5

source: Tools
es: Herramientas

source: Javascript library for feature detection and control fallback cases of HTML5.
es: Librería de Javascript para la detección de funciones y el control de casos de reserva de HTML5.

source: Javascript patch to make IE support, and print, the new tag elements.
es: Parche Javascript para que IE admita e imprima los elementos de la nueva etiqueta

source: An set of HTML/CSS/JS templates with best practices for HTML5 and front-end dev built in.
es: Un conjunto de plantillas HTML, CSS y JavaScript que incorpora prácticas recomendadas para la integración del desarrollo de la interfaz y HTML5

source: The collection of scripts that enable HTML5 features in all browsers.
es: El conjunto de secuencias de comandos que permiten las funciones de HTML5 en todos los navegadores

source: Preview CSS buttons with a fancy interface to play with the parameters.
es: Obtén una vista previa de los botones CSS con una interfaz elegante para hacer pruebas con los parámetros.

source: Test and get the code of the fanciest CSS features.
es: Prueba y obtén el código de las funciones CSS más elegantes.

source: Generate CSS code for gradients on the fly.
es: Generar código CSS para los gradientes sobre la marcha

source: Use CSS3 without having to worry about xbrowser differences.
es: Utiliza CSS3 sin tener que preocuparte por las diferencias del navegador xbrowser.

source: Test your fonts using drag and drop.
es: Prueba tus fuentes mediante la función de arrastrar y soltar.

source: Most complete tool to generate code for you font-face support.
es: La herramienta más completa para generar código para la compatibilidad con font-face

source: Complete list of tools related to web performance.
es: Lista completa de herramientas relacionadas con el rendimiento web.

source: Books
es: Libros

source: Search Results
es: Resultados de búsqueda

source: Loading
es: Cargando

source: Videos and Presentations
es: Videos y presentaciones

source: Slides, Presen&shy;ta&shy;tions & Videos
es: Diapositivas, Presen&shy;ta&shy;ciones y videos

source: Below you can get your hands on the most recent presentations by Google Chrome Developer Relations and friends. Video is shared if available and you can view them by person, topic or event.
es: A continuación, puedes explorar las presentaciones más recientes de Relaciones de programadores de Google y amigos. Los videos se comparten si están disponibles y puedes verlos por persona, tema o evento.

source: Filter the talks to your liking
es: Filtra las conversaciones a tu gusto.

source: filter by topic, person, etc
es: filtrar por tema, persona, etc.

source: Only show talks more recent than:
es: Mostrar solo las conversaciones más recientes que:

source: Loading...
es: Cargando...

source: Terms of Service
es: Condiciones del servicio

source: HTML5 Rocks <span>Terms of Service</span>
es: <span>Condiciones del servicio</span> de HTML5 Rocks

source: The HTML5ROCKS website (the "Website") is hosted by Google. By using and/or visiting the Website, you consent to be bound by these terms of service as well as Google's general <a href="http://www.google.com/accounts/TOS">Terms of Service</a> and Google's general <a href="http://www.google.com/privacy.html">Privacy Policy</a>.
es: El sitio web de HTML5ROCKS (el "sitio web") está alojado en Google. Al utilizar o visitar el sitio web, aceptas regirte por estas condiciones del servicio así como por las <a href="http://www.google.com/accounts/TOS">Condiciones del servicio</a> generales y la <a href="http://www.google.com/privacy.html">Política de privacidad</a> de Google.

source: Why HTML5 Rocks
es: Por qué HTML5 Rocks

source: Why HTML5 <span>Rocks</span>
es: ¿Por qué HTML5 <span>Rocks</span>?

source: HTML5 introduces many cutting-edge features that enable developers to create apps and websites with the functionality, speed, performance, and experience of desktop applications. But unlike desktop applications, apps built on the web platform can reach a much broader audience using a wider array of devices. HTML5 accelerates the pace of your innovation and enables you to seamlessly roll out your latest work to all your users simultaneously.
es: HTML5 presenta muchas características de vanguardia que permiten a los programadores crear aplicaciones y sitios con la funcionalidad, la velocidad, el rendimiento y la experiencia de las aplicaciones de escritorio. Pero a diferencia de las aplicaciones de escritorio, las aplicaciones que se crean en la plataforma web puede llegar a un público mucho más amplio con una gama más amplia de dispositivos. HTML5 acelera el ritmo de tu innovación y te permite implementar sin problemas tu último trabajo en todos los usuarios de forma simultánea.

source: Give me everything
es: Dame todo

source: Tutorials
es: Tutoriales

source: Why move to HTML5 now than later?
es: ¿Por qué comenzar a utilizar HTML5 lo antes posible?

source: Tools &amp; Frameworks
es: Herramientas &amp; marcos

source: Additional Resources
es: Recursos adicionales

source: Recent Contributors
es: Colaboradores recientes

source: More efficient connectivity means more real-time chats, faster games, and better communication. Web Sockets and Server-Sent Events are pushing (pun intended) data between client and server more efficiently than ever before.
es: Una conectividad más eficiente te garantiza más cuadros en tiempo real, juegos más rápidos y una mejor comunicación. Las conexiones web y los eventos enviados por el servidor lanzan (es intencional el énfasis) los datos entre el cliente y el servidor más eficazmente que nunca.

source: HTML5 agency Bocoup's deep research into EventSource
es: Investigación profunda realizada por la agencia Bocoup de HTML5 sobre EventSource

source: a hosted API for adding scalable realtime WebSockets functionality to your apps
es: de una API alojada para proporcionar mayor funcionalidad de los conectores web escalables en tiempo real para tus aplicaciones.

source: The power of the EventSource API across browsers
es: El poder de la API EventSource en los navegadores

source: Feature
es: Función

source: What&rsquo;s New
es: Novedades

source: loading&hellip;
es: cargando&hellip;

source: iOS Safari
es: Safari iOS

source: Opera Mobile
es: Opera Móvil

source: Data courtesy of <a href="http://caniuse.com/">caniuse.com</a> and <a href="http://dev.chromium.org/developers/web-platform-status">Chrome Platform Status</a>.
es: Los datos son cortesía de <a href="http://caniuse.com/">caniuse.com</a> y <a href="http://dev.chromium.org/developers/web-platform-status">Estado de Plataforma de Chrome</a>.

source: HTML5 provides very powerful APIs to interact with binary data and a user's local file system. The File APIs give web applications the ability to do things like read files [a]synchronously, create arbitrary Blobs, write files to a temporary location, recursively read a file directory, perform file drag and drop from the desktop to the browser, and upload binary data using <code>XMLHttpRequest2</code>.
es: HTML5 proporciona API muy potentes para interactuar con datos binarios y con el sistema de archivos local del usuario. Las API de archivo permiten a las aplicaciones web realizar tareas como leer archivos de forma [a]síncrona, crear Blobs arbitrarios, escribir archivos en una ubicación temporal, leer de manera recursiva un directorio de archivos, arrastrar y soltar archivos del escritorio al navegador y subir datos binarios con el código <code>XMLHttpRequest2</code>.

source: As examples, the File APIs can be used to create a thumbnail preview of images as they're being sent to the server, or allow an app to save a file reference while the user is offline. Using the <a href="https://dvcs.w3.org/hg/audio/raw-file/tip/webaudio/specification.html">Web Audio API</a>, your app could read an .mp3 file and display a visualization of the song as it plays. Additionally, you could use client-side logic to verify an upload's mimetype matches its file extension or restrict the size of an upload.
es: A modo de ejemplo, las API de archivo se pueden utilizar para crear una vista previa en miniatura de las imágenes que se envían al servidor, o para permitir que una aplicación guarde un archivo de referencia mientras el usuario no está conectado. Con la <a href="https://dvcs.w3.org/hg/audio/raw-file/tip/webaudio/specification.html">API de audio web</a>, tu aplicación podría leer un archivo .mp3 y mostrar una visualización de la canción mientras se reproduce. Además, podrías usar la lógica del cliente para verificar que el tipo MIME de una carga coincida con su extensión de archivo o para limitar el tamaño de una carga.

source: This W3C specification defines the File APIs: <code>File</code>, <code>FileList</code>, <code>FileReader</code>, <code>Blob</code>.
es: Esta especificación W3C define la API del archivo: <code>File</code>, <code>FileList</code>, <code>FileReader</code>, <code>Blob</code>.

source: This W3C specification defines the FileSystem APIs; which provide an interface for reading and writing files and directories in a sandboxed file system.
es: Esta especificación W3C define las API de sistemas de archivos, lo que proporciona una interfaz para leer y escribir archivos y directorios en un sistema de archivos protegido.

source: This W3C specification defines the FileWriter API; which provides an interface for writing to files from web applications.
es: Esta especificación W3C define la API de FileWriter, lo que proporciona una interfaz para escribir en los archivos de aplicaciones web.

source: This W3C specification defines the ProgressEvent; which gives asynchronous updates on the progress of a File read.
es: Esta especificación de W3C define el objeto ProgressEvent, que te brinda actualizaciones asíncronas sobre el progreso de lectura de un archivo.

source: This whatwg specification defines the native HTML5 drag and drop APIs
es: Esta especificación WHATWG define las API nativas de arrastrar y soltar de HTML5.

source: Tutorial on using Drag and Drop, FileAPI and XMLHttpRequest to upload files.
es: Tutorial sobre el uso de arrastrar y soltar, y de FileAPI y XMLHttpRequest para cargar los archivos

source: Reference on the various dragging options that are available in the DnD API
es: Referencia sobre las distintas opciones de arrastre que están disponibles en la API DnD

source: Article on using Native Drag and Drop in HTML5. Discusses File drag/drop from desktop.
es: Artículo sobre el uso de la función de arrastrar y soltar nativa en HTML5 que proporciona información sobre cómo arrastrar y soltar archivos desde el escritorio

source: Graphics
es: Gráficos

source: The web has always been a visual medium, but a restricted one at best. Until recently, HTML developers were limited to CSS and JavaScript in order to produce animations or visual effects for their websites, or they would have to rely on a plugin like Flash.
es: La Web siempre ha sido un medio visual, pero limitado. Hasta hace poco, los programadores de HTML estaban limitados a utilizar CSS y JavaScript para crear animaciones o efectos visuales para sus sitios web, o debían confiar el un complemento, como Flash.

source: With the addition of technologies like the canvas element, Web GL, and SVG images, this is no longer the case! In fact, there are many new features which deal with graphics on the web: 2D Canvas, WebGL, SVG, 3D CSS transforms, and SMIL.
es: Con la incorporación de tecnologías como el elemento canvas, Web GL e imágenes SVG, esto ya no ocurre. De hecho, hay muchas características nuevas que se ocupan de los gráficos en la Web: Canvas 2D, WebGL, SVG, transformaciones CSS 3D y ​​SMIL.

source: Of course, none of these new technologies would be useful if they weren&rsquo;t capable of running fast. Thankfully, JavaScript engines have become fast enough to run 3D games and manipulate video in realtime. Hardware accelerated compositing is also being implemented in many browsers, meaning that even CSS transitions and transforms will be butter-smooth.
es: Por supuesto, ninguna de estas nuevas tecnologías sería útil si no funcionaran rápido. Afortunadamente, los motores de JavaScript se han vuelto lo suficientemente rápidos para ejecutar juegos en 3D y manipular videos en tiempo real. La composición acelerada por hardware también se está implementando en muchos navegadores, lo que significa que hasta las transiciones CSS y las transformaciones fluirán como el agua.
